---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralMaterialType.Steel
enum: Autodesk.Revit.DB.Structure.StructuralMaterialType
source: html/133caafb-a1f6-699a-fde1-f5fb79e64560.htm
---
# Autodesk.Revit.DB.Structure.StructuralMaterialType.Steel

Structural material type is steel.